BATSNet/sims/sims-mesh-device-idf/sdkconfig.defaults
# ESP-IDF Configuration Defaults for SIMS Mesh Device
# Heltec WiFi LoRa 32 V3 (ESP32-S3 + SX1262)

# ESP32-S3 Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# No PSRAM (Heltec V3 has none)
CONFIG_ESP32S3_SPIRAM_SUPPORT=n
CONFIG_SPIRAM=n

# Flash Configuration (8MB flash)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Bluetooth - NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=n

# SPI Master (for LoRa SX1262)
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# UART (for GPS)
CONFIG_UART_ISR_IN_IRAM=y

# I2C (for OLED)
CONFIG_I2C_ISR_IN_IRAM=y

# Serial Console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# SPIFFS Configuration
CONFIG_SPIFFS_MAX_PARTITIONS=3

# C++ Exceptions (RadioLib uses them)
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# Serial port for flashing
CONFIG_ESPTOOLPY_PORT="COM7"
